
define adam = Character('Адам', color="#e9d672")
define reckviem = Character('Реквием', color="#873636")
define tenshi = Character('Тенши', color="#6ea1ff")
define estrella = Character('Эстрелла', color="#514c61")
define evgent = Character('Евгент', color="#d9355c")
define artemis = Character('Артемис', color="#5dced3")
define yunia = Character('Юния', color="#9f6ced")
define illiya = Character('Иллия', color="#d76c97")
define kafka = Character('Кафка', color="#e34074")
define ike = Character('Ике', color="#777777")
define ouro = Character('Оуро', color="#6bb28d")
define omega = Character('Омега', color="#000000")
define vesta = Character('Веста', color="#93768f")
define otto = Character('Отто', color="#5f4e37")
define pristsilla = Character('Присцилла', color="#514c61")
define hotaru = Character('Хотару', color="#d39d55")
define alice = Character('Алиса', color="#78a5c2")

image defaultbg = "defualtbg.png"


label start:

    scene defaultbg

    "Сколько не смотри в эту сферу, богом она вряд-ли себя почувствует."
    "Некто великий, смотрящий за людьми разных вселенных, в момент их ярких воспоминаний."
    "Она знает про всё и обо всем, можно сказать, при создании первого цикла этой жалкой кучки метавселенных, все природные законы писаны её руками."
    "Но никто этого не вспомнит."
    "Единственное, что она оставит за собой - чувство дежавю или паранойи."
    "Когда вам кажется, что за вами кто-то следит, знайте - это Зависть."
    "Изо дня в день, её задачей следить за мирным течением времени в нексусах."
    "Но это при условии, что в месте, к которому она привязана, есть смена суток."
    "Представьте мир, где понятие ночи отдалённо напоминает сказку, а местное солнце светит вечно."
    "Мраморный, изящный дворец, блестящий под искусственным светилом круглый год."
    "И, конечно, куда же без зелени да милых зверят, коих человек и вообразить не мог."
    "Будто неприступный живой душе рай, правда?"
    show es arms crossed at right
    estrella "Не все согласны с таким выводом, господин рассказчик."
    "Ах, ну точно. За исключением одного миротворца, у которого за всё существование не было возможности отсюда выбраться. "
    show es shy
    estrella "Пожалуйста, не говорите так, будто я не пыталась выйти. "
    estrella "В последний раз, когда я случайно убила динозавров, меня стёрли."
    estrella "Я до сих пор не понимаю, зачем Реквием это делает, если я всё равно всё помню..."
    show es
    "Не знаю."
    "В любом случае, мне нужно продолжить рассказ."
    show es eyes closed
    estrella "Прошу прощения. "
    "Относительно дворца. "
    "Он здесь как главный, эм... Штаб?.."
    "Для миротворцев."
    "Они по сути боги, если сравнивать с религиями людей. "
    "Всего их 10, но так было не всегда."
    "Как вы уже могли заметить, эта сущность в виде гномика по имени Эстрелла, одна из них. "
    estrella "..."
    show es at center
    with dissolve
    "Прежде упомянутая Зависть."
    "Это и есть наша главная героиня. "
    "Она не всегда была такой. Знаете, одиночество пожирает изнутри."
    "Единственный раз, когда она может с кем-то поговорить - либо проникнуть в человеческий сон, либо когда её сущность стирают, словно прочерк ластиком."
    "Поэтому, она решила вернуть всё на свои места. "
    "Перезаписать вселенные."
    "Не две, не три."
    "Все, включая этот чуждый дворец."
    return