
define adam = Character('Адам', color="#e9d672")
define reckviem = Character('Реквием', color="#873636")
define tenshi = Character('Тенши', color="#6ea1ff")
define estrella = Character('Эстрелла', color="#514c61")
define evgent = Character('Евгент', color="#d9355c")
define artemis = Character('Артемис', color="#5dced3")
define yunia = Character('Юния', color="#9f6ced")
define illiya = Character('Иллия', color="#d76c97")
define kafka = Character('Кафка', color="#e34074")
define ike = Character('Ике', color="#777777")
define ouro = Character('Оуро', color="#6bb28d")
define omega = Character('Омега', color="#000000")
define vesta = Character('Веста', color="#93768f")
define otto = Character('Отто', color="#5f4e37")
define pristsilla = Character('Присцилла', color="#514c61")
define hotaru = Character('Хотару', color="#d39d55")
define alice = Character('Алиса', color="#78a5c2")

image defaultbg = "defualtbg.png"

image es fade = im.MatrixColor( 
    "es.png", 
    im.matrix.brightness(-0.2)
)

image es arms crossed fade = im.MatrixColor( 
    "es arms crossed.png", 
    im.matrix.brightness(-0.2)
)

image es eyes closed fade = im.MatrixColor( 
    "es eyes closed.png", 
    im.matrix.brightness(-0.2)
)

image es shy fade = im.MatrixColor( 
    "es shy.png", 
    im.matrix.brightness(-0.2)
)


image pris fade = im.MatrixColor( 
    "pris.png", 
    im.matrix.brightness(-0.2)
)



image evgnt fade = im.MatrixColor( 
    "evgnt.png", 
    im.matrix.brightness(-0.2)
)


label start:

    scene defaultbg
    "Некто великий, смотрящий за людьми разных вселенных, в момент их ярких воспоминаний. Её знания ничем не ограничиваются, ведь всё что вы считаете реальным, создала именно она."
    "Но разве обычный ум сможет соревноваться со всемогуществом?"
    "Сейчас единственное, на что она способна - заставлять вас чувствовать паранойю. Когда вам кажется, что за вами кто-то следит, сомнений быть не может - это Зависть."
    "Изо дня в день, её жизнь проходит однообразно."
    "Но это при условии, что в месте, к которому она привязана, есть смена суток, иначе можно сказать, что Зависть живёт одним бесконечным днём."
    "Представьте: мир, где понятие ночи отдалённо напоминает сказку, а местное солнце светит вечно."
    "Мраморный, изящный дворец, блестящий под искусственным светилом круглый год."
    "И, конечно, куда же без зелени да милых зверят, коих человек и вообразить не мог, ведь их познания ограничиваются на живых формах собственной планеты, а фантазия порождает страхи и конфликты."
    "Будто неприступный живой душе элизиум, правда?"
    show es at center
    estrella "Не все согласны с таким выводом, мисс рассказчик."
    show es at right
    show es fade
    "Ах, ну точно. За исключением одного «божества», у которого за всё существование не было возможности прожить хотя бы один день с удовольствием. Ох, о чем это я? Забавно получается."
    show es
    estrella "Пожалуйста, не говорите так, будто я не пыталась выбраться. Последний раз, когда я попала в один из реальных миров, планета, на которой находились мои первые создания, чуть не уничтожилась."
    estrella "После этого я снова лишилась части своих способностей. Всё, что я теперь могу, это жалкие иллюзии."
    show es fade
    "«Они теперь смертные, нет смысла хвататься за их жалкие жизни так, словно они тебе не безразличны.»"
    show es
    estrella "Это слова Кафки, не твои."
    show es fade
    "Верно, я ведь её и цитирую."
    show es
    estrella "..."
    "Ты меня перебила."
    show es fade
    "Этот мир мал, но идя вперёд, со временем можно понять, что ты на каком-то моменте пошёл назад. Ты не обойдёшь целую планету, если это пространство таковым являлось бы."
    "Помимо Зависти есть другие разумные существа."
    "Они по сути боги, если сравнивать с религиями людей, что довольно иронично, учитывая их псевдонимы."
    "Как вы уже могли заметить, эта сущность в виде гномика по имени Эстрелла, одна из них."
    show es
    estrella "..."
    show es fade
    "Прежде упомянутая Зависть, к слову, и есть наша главная героиня."
    "Она не всегда была такой. Знаете, есть вещи, о которых трудно говорить даже мне, поэтому просто имейте ввиду, что случилось нечто катастрофически разрушительное."
    "Считайте, что это чудо, ведь вам выпала возможность наблюдать за историей вашего создателя."
    hide es
    "Она шла по пустым коридорам дворца. Совсем одна, в полной тишине."
    "Лишь цоканье её каблуков заполняло бесконечно долгую анфиладу."
    "Это место перестраивается каждый раз, когда Эстрелла по нему ходит."
    "Это сделали для того, чтобы она не нашла путь до бреши, и всегда возвращалась в свою комнату."
    "Её коллеги, без сомнений, жестокие. Однако даже они не знают где какая комната, если дворец в очередной раз изменился."
    "Однако, так или иначе, подобное её уж точно ещё ни разу не останавливало."
    "Побродя достаточно долго, она всё же нашла нужное место."
    "Это искаженное пространство, находящееся в сердце здания, через которое можно попасть куда угодно. Брешь."
    "Это, как правило, распространяется не только на пространство, но и на время."
    "Любой таймлайн, любая вселенная в доступе."
    show es at center
    estrella "Мою пропажу они обнаружат не сразу."
    estrella "Я успею многое сделать, перед тем, как вернуться."
    show es at right
    show es fade
    "???" "Снова?"
    "Со спины послышался женский голос."
    "После тона Зависти, громкость её слов была сильнее."
    "Девушка, выглядящая как абсолютная копия Эстреллы, но словно её теневая проекция."
    show es
    show pris fade at left
    estrella "Как долго ты меня преследовала?"
    show es fade
    show pris
    pristsilla "С того момента, как услышала рассказчика. Это ведь и раньше случалось, этот голос нельзя забыть."
    show es
    show pris fade
    estrella "Почему я слышу его, а другие нет? Это воистину раздражающе, когда ты слышишь что любое твоё действие описывает голос того, кого ни разу не видел."
    show es fade
    show pris
    pristsilla "Присцилла не знает."
    show es
    show pris fade
    estrella "Естественно. Если я не знаю, то и ты, соответственно, не можешь."
    show es fade
    "Эстрелла отвернулась от неё и протянула руку до бреши, почувствовав сильное давление."
    show es
    estrella "Прис."
    show es fade
    show pris
    pristsilla "Хм?~"
    show es
    show pris fade
    estrella "Ты отправишься со мной?"
    show es fade
    show pris
    pristsilla "Разве Присцилла сможет чем-то помочь?"
    show es
    show pris fade
    estrella "Хорошо, я поняла."
    show es fade
    show pris
    pristsilla "Присцилла пострадает, если будет находиться здесь во время вашего ухода."
    show es
    show pris fade
    estrella "Ступай."
    show es fade
    hide pris fade
    hide pris
    "Проведя взглядом свою тень, Эстрелла удостоверилась, что та ушла достаточно далеко, чтобы войти в искаженное пространство."
    hide es
    "Дверь закрылась с той стороны, а облик Зависти скрылся в разломе квантов."
    "В комнате всё исказилось, а брешь лишь сильнее разрослась."
    "Её путешествие только началось. Девушка не падала, скорее что-то тянуло Эстреллу вниз. Но вокруг была лишь тьма."
    "Этот полёт был недолгим, она моргнуть не успела, как оказалась в другом мире."
    "Однако она не останавливалась."
    "Это не та вселенная, что ей нужна."
    "Огромные динозавры шагали по земле, а растительность скрывала за собой большую опасность. Воздух был вязким."
    "Не коснувшись земли, она снова путешествовала по чуждой планете. И снова промах."
    "Это определённо не то место, куда ей нужно."
    "Вокруг были лишь языки яркого пламени, а запах гари до слёз душил. Огонь поглотил здесь всё живое. От растительности остались лишь угли."
    "Одна секунда, и Эстрелла снова видит новую сцену."
    "Она почувствовала, словно в ней пропали все цвета, и в глазах всё стало чёрно-белым. Будто на старой плёнке, любое движение было покадровым."
    "Ощущения, что она вот-вот распадётся на бесформенную материю."
    "И снова. Новая вселенная."
    "Почти упав на землю, она повисла в воздухе."
    "Всего-то за пару десятков сантиметров до поверхности она осталовилась."
    "От резкого изменения цветов она на миг ослепла."
    "Открыв глаза вновь, она увидела как вокруг был океан. Что-то огромное под водой проплыло под ней, издавая душераздирающие крики."
    "Впервые за столько времени Зависть почувствовала страх. Слабость перед морем, и тем, что там водится."
    "Не успела она опомниться, как та же сила потянула её снова, но уже в горизонтальном направлении."
    "Казалось, сейчас её от такой скорости разорвет в клочья."
    "Она не могла в таком положении держать равновесие, и кое-как оседлав поток пространства-времени, успокоилась."
    "Девушка пролетела живописные горы, над коронами которых пролетали крылатые саламандры. Они выглядели изящно и величественно."
    "Захватывающий дух пейзаж сменился не менее любопытным."
    "По пернатым облакам, словно по волнам, плыли огромные белые киты. Их тоскливая песня рвала сердце на куски."
    "Благо, у Зависти его нет."
    "Их плач сменился шумом ночного города, который как ни в чём не бывало игнорировал наличие сетей невероятно гигантских пауков между домами. Будто так и должно быть."
    show es at right
    estrella "О мой Сириус, когда же это закончится!?"
    hide es
    "Девушка облетела ещё несколько таймлайнов, прежде чем остановиться в одном из них."
    "Неудачно приземлившись, она жестко прокатилась по поверхности и пала у чьих-то ног."
    show evgnt at left
    show es fade at right
    "???" "Что за..."
    show evgnt fade
    "Эстрелла попыталась подняться, но чуть не стошнило. Она прикрыла рот рукой, но благо, рвать ей было нечем."
    "Став на ноги, та увидела перед собой мужчину."
    show es

    estrella "Уф, кошмар..."
    estrella "Человек, где я сейчас нахожусь?"
    show es fade
    show evgnt
    "???" "Это мой сон."
    show es
    show evgnt fade
    estrella "Сон?"
    estrella "Странно, брешь во сны не отправляет."
    estrella "Я..."
    estrella "Я потеряла сознание?"
    show es fade
    show evgnt
    "???" "Какая чушь!"
    "???" "За всё это время в моём сне ничего не менялось."
    "???" "Почему сейчас..."
    show es
    show evgnt fade
    estrella "Похоже, это не сон, а нексус..."
    show es fade
    show evgnt
    "???" "Чего?"
    show es
    show evgnt fade
    estrella "Нексус... Я просила брешь привести меня к тебе, но похоже, ты не очень вовремя лёг спать."
    estrella "Мне нужно, чтобы ты проснулся."
    show es fade
    show evgnt
    "???" "С чего это мне тебя слушать?"
    show es
    show evgnt fade
    estrella "Я твой создатель, делай как я велю."
    estrella "Немедленно перенеси нас в реальный мир."
    hide es fade
    hide es
    hide evgnt fade
    hide evgnt

    "В миг мужчина перед ней распался на кучу маленьких оригами."
    "Бумажные журавли полетели под ноги Эстреллы, и пол под ней рассыпался словно песок."
    "Она оказалась в чьей-то комнате."
    "Помещение было до ужаса загрязнённым мусором и плесенью, местами наблюдалась хитиновая живность."
    show evgnt at left
    "???" "Что за чертовщина..."
    "???" "Ты."
    "???" "Ты только что была в моём сне."
    "???" "Как ты тут оказалась?"
    show evgnt fade
    show es at right
    estrella "Ах, Евгент."
    show es fade
    "Когда девушка произнесла его имя, тот посмотрел на неё с удивлённым взглядом, открыв рот."
    show evgnt
    evgent "Откуда ты знаешь как меня зовут?"
    show es
    show evgnt fade
    estrella "Я знаю о тебе всё."
    estrella "Я ведь уже сказала, я твой создатель."
    show es fade
    show evgnt
    evgent "Что-то типа матери?"
    show es
    show evgnt fade
    estrella "Ха-ха-ха..."
    estrella "Ладно, ты стал немного глупее и наивнее, чем был абсолютную бесконечность тому назад."
    show es fade
    show evgnt
    evgent "Не понимаю..."
    show es
    show evgnt fade
    estrella "Создатель в прямом смысле."
    estrella "Это никакая не метафора."
    estrella "Я - Эстрелла, творец всего, что ты привык считать реальным."
    show es fade
    show evgnt
    evgent "Бог?"
    show es
    show evgnt fade
    estrella "Да нет же..."
    estrella "М-м, ладно, называй это как хочешь."
    show es fade
    show evgnt
    evgent "Ладно, я с трудом тебе поверю."
    show es
    show evgnt fade
    estrella "Так это, эм..."
    estrella "Твоя комната?"
    estrella "Я думала, ты просто по-пьяне уснул на какой-то помойке."
    show es fade
    show evgnt
    evgent "Представь себе, не все люди живут в роскоши."
    show es
    show evgnt fade
    estrella "Представляю. К тому же это именно я создала такой баланс."
    estrella "Не будем об этом."
    estrella "Мне нужна твоя помощь."
    show es fade
    show evgnt
    evgent "Что Богу может понадобиться от такого жалкого смертного как я?"
    show es
    show evgnt fade
    estrella "Пока я не могу тебе рассказать, что именно мне от тебя понадобится, поскольку мне нужно для начала многое объяснить."
    estrella "Однако, позволь возразить: ты не настолько жалкий."
    estrella "Ну, может быть, совсем малость ты и ничтожество, но всяко лучше чем я на данный момент."
    show es fade
    show evgnt
    evgent "Ты сама доброта."
    show es
    show evgnt fade
    estrella "Да, доброты мне не занимать!"
    estrella "В общем. Ты - самое первое, что я создала. Даже вселенные и близко с тобой не стоят."
    estrella "Именно поэтому мне нужен именно ты."
    show es fade
    show evgnt
    evgent "Я что, такой старый?"
    show es
    show evgnt fade
    estrella "О, да!"
    estrella "Ты даже старее чем этот мир, Антарес."
    show es fade
    show evgnt
    evgent "Антарес?"
    show es
    show evgnt fade
    estrella "Хм? Разве это не твоё второе имя?"
    show es fade
    show evgnt
    evgent "Нет."
    show es
    show evgnt fade
    estrella "Ну, никогда не поздно обрести свою сигнатурную звезду заново."
    estrella "Со временем звёзды умирают, но Антарес будет вечен из-за твоего существования."
    estrella "Кстати о времени..."

    return
